### IS727272 - Cordero Hernández, Marco Ricardo

# 12. Ejercicio de Manipulación de datos

### Filtrar datos de un dataframe.

    1. Crear una lista de 50 valores aleatorios entre los valores de 0 a 100
    2. Convertir esa lista en un dataframe de 5 filas por 10 columnas
    3. Filtrar los datos del dataframe para visualizar solo los valores mayores de 50

In [1]:
#Importar librerías
import numpy as np
import pandas as pd

In [2]:
#1. Crear una lista de 50 valores aleatorios entre los valores de 0 a 100

lst_rand_50 = np.random.randint(0, 101, 50)
lst_rand_50

array([ 86,  57,  43,  51,  59,  21,  18,  33,  59,   6,  27,  56, 100,
        34,  61,  57,  91,  70,  51,  10,  82,  39,  37,   9,  59,  51,
        73,   8,  12,  94,  52,  75,  15,  51,  93,  22,   4,  11,  53,
        51,   4,  46,  47,  27,  56,  64,   2,  91,  13,  23])

In [3]:
#Función reshape no modifica la variable

lst_rand_50 = lst_rand_50.reshape(5, 10)
lst_rand_50

array([[ 86,  57,  43,  51,  59,  21,  18,  33,  59,   6],
       [ 27,  56, 100,  34,  61,  57,  91,  70,  51,  10],
       [ 82,  39,  37,   9,  59,  51,  73,   8,  12,  94],
       [ 52,  75,  15,  51,  93,  22,   4,  11,  53,  51],
       [  4,  46,  47,  27,  56,  64,   2,  91,  13,  23]])

In [4]:
#2. Convertir esa lista en un dataframe de 5 filas por 10 columnas

df_lst = pd.DataFrame(lst_rand_50)
df_lst

    0   1    2   3   4   5   6   7   8   9
0  86  57   43  51  59  21  18  33  59   6
1  27  56  100  34  61  57  91  70  51  10
2  82  39   37   9  59  51  73   8  12  94
3  52  75   15  51  93  22   4  11  53  51
4   4  46   47  27  56  64   2  91  13  23

In [5]:
#3. Filtrar los datos del dataframe para visualizar solo los valores mayores de 50

# Para primera columna
col0 = df_lst[0]
col0[col0 > 50]

0    86
2    82
3    52
Name: 0, dtype: int32

In [6]:
# Para dataframe entero
df_lst[df_lst > 50]

      0     1      2     3   4     5     6     7     8     9
0  86.0  57.0    NaN  51.0  59   NaN   NaN   NaN  59.0   NaN
1   NaN  56.0  100.0   NaN  61  57.0  91.0  70.0  51.0   NaN
2  82.0   NaN    NaN   NaN  59  51.0  73.0   NaN   NaN  94.0
3  52.0  75.0    NaN  51.0  93   NaN   NaN   NaN  53.0  51.0
4   NaN   NaN    NaN   NaN  56  64.0   NaN  91.0   NaN   NaN

In [7]:
# Por columnas
for c in df_lst:
    col_c = df_lst[c]
    print(f'Mínimos columna {c}', col_c[col_c > 50], sep='\n', end='\n\n')

Mínimos columna 0
0    86
2    82
3    52
Name: 0, dtype: int32

Mínimos columna 1
0    57
1    56
3    75
Name: 1, dtype: int32

Mínimos columna 2
1    100
Name: 2, dtype: int32

Mínimos columna 3
0    51
3    51
Name: 3, dtype: int32

Mínimos columna 4
0    59
1    61
2    59
3    93
4    56
Name: 4, dtype: int32

Mínimos columna 5
1    57
2    51
4    64
Name: 5, dtype: int32

Mínimos columna 6
1    91
2    73
Name: 6, dtype: int32

Mínimos columna 7
1    70
4    91
Name: 7, dtype: int32

Mínimos columna 8
0    59
1    51
3    53
Name: 8, dtype: int32

Mínimos columna 9
2    94
3    51
Name: 9, dtype: int32